import cv2

'''Питон включает камеру и начинается запись видео, в цикле считываются каждый кадр, отображается в командной строке
в виде массива, цвет кадра меняется на серый, далее повляется окно с кадром, кадры сменяют друг друга через указанный
промежуток времени (здесь 1 сек)по нажатию клавиши q происходит выход из цикла, видео завершается, окна закрываются


'''
video = cv2.VideoCapture(0)  # запускает захват видео объекта; в параметры передаём
# либо путь к видео файлу,
# либо цифры (0,1,2,3....), которые означают индекс записывающей в реальном времени камеры

while True:  # используем цикл для считывания каждого кадра видео
    check, frame = video.read()  # check - логическая переменная проверяет записывается видео или нет, frame - масив
    # Numpy
    
    print(check)
    print(frame)
    
    gray = cv2.cvtColor(frame, cv2.COLOR_BGR2GRAY)  # конвертация цвета в серый
    cv2.imshow('Capturing', gray)
    
    key = cv2.waitKey(1000)  # ставим время задержки скрипта перед началом следующей итерации(если оставить 0,
    # то по нажатию) количество секунд храним в переенной
    #  клавиши программа прекратит работу) time sleep больше не нужен
    
    if key == ord('q'):  # метод ord позволяет считывать нажатую клавишу и выполнять условие
        break

video.release()

cv2.destroyAllWindows()
